const config = require('../config')
const {cmd , commands} = require('../command')
cmd({
    pattern: "allmenu",
    react: "👾",
    desc: "get allmenu",
    category: "main",
    filename: __filename
},
async(ishan, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{
let menu = {
main: '',
download: '',
group: '',
owner: '',
mathtool: '',
search: '',
ai: '',
movie: '',
logo: ''


};

for (let i = 0; i < commands.length; i++) {
if (commands[i].pattern && !commands[i].dontAddCommandList) {
menu[commands[i].category] += `*┋* ${commands[i].pattern}\n`;
 }
}

let madeMenu = `*╭─────────────────❒⁠⁠⁠⁠*

*⇆ ʜɪ ᴍʏ MENU ⇆*

     *${pushname}*

┏━━━━━━━━━━━━━━━━━━━━
   *Welcome to ISHAN-X ALLMENU*
┗━━━━━━━━━━━━━━━━━━━━

*Created by ISHAN-X 👨🏻‍💻*


*╭───────────────❒⁠⁠⁠⁠*
*│* *❂ DOWNLOAD CMDS❂*
*┕───────────────❒*
*╭──────────●●►*
${menu.download}
*╰──────────●●►*

*╭───────────────❒⁠⁠⁠⁠*
*│* *❂MAIN CMDS❂*
*┕───────────────❒*
*╭──────────●●►*
${menu.main}
*╰──────────●●►*

*╭───────────────❒⁠⁠⁠⁠*
*│* *❂GROUP CMDS❂*
*┕───────────────❒*

*╭──────────●●►*
${menu.group}
*╰──────────●●►*

*╭───────────────❒⁠⁠⁠⁠*
*│* *❂OWNER CMDS❂*
*┕───────────────❒*

*╭──────────●●►*
${menu.owner}
*╰──────────●●►*

*╭───────────────❒⁠⁠⁠⁠*
*│* *❂MATHTOOL CMDS❂*
*┕───────────────❒*

*╭──────────●●►*
${menu.mathtool}
*╰──────────●●►*

*╭─────────────────❒⁠⁠⁠⁠*
*│* *❂SEARCH CMDS ❂*
*┕─────────────────❒*

*╭──────────●●►*
${menu.search}
*╰──────────●●►*

*╭─────────────────❒⁠⁠⁠⁠*
*│* *❂AI CMDS ❂*
*┕─────────────────❒*

*╭──────────●●►*
${menu.ai}
*╰──────────●●►*

*╭─────────────────❒⁠⁠⁠⁠*
*│* *❂MOVIE CMDS ❂*
*┕─────────────────❒*

*╭──────────●●►*
${menu.movie}
*╰──────────●●►*

*╭─────────────────❒⁠⁠⁠⁠*
*│* *❂LOGO CMDS ❂*
*┕─────────────────❒*

*╭──────────●●►*
${menu.logo}
*╰──────────●●►*



> *Powered by botname*

`;

await ishan.sendMessage(from,{image:{url:config.MENU_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
